//=========================================================
//
// チャージサイン処理 [ chargesignal.h ]
// Author: Asuma Nishio
//
//=========================================================

//*********************************************************
// インクルードガード
//*********************************************************
#pragma once

//*********************************************************
// インクルードファイル
//*********************************************************
#include "object2D.h"

//*********************************************************
// 前方宣言
//*********************************************************
class CObject;

//*********************************************************
// チャージサインクラスを定義
//*********************************************************
class CChargeSignal : public CObject2D
{
public:
	// コンストラクタ・デストラクタ
	CChargeSignal(int nPriority = static_cast<int>(CObject::PRIORITY::UI));
	~CChargeSignal();

	// メンバ関数
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);

	// 静的メンバ関数
	static CChargeSignal* Create(D3DXVECTOR3 pos);

private:
	int m_nLife; // 生存フレーム
};