//=========================================================
//
// メイン関数 [ main.h ]
// Author: Asuma Nishio
//
//=========================================================

//*********************************************************
// インクルードガード
//*********************************************************
#pragma once

//*********************************************************
// メインプロセスクラスを定義
//*********************************************************
class CMainProc
{
public:
	// コンストラクタ・デストラクタ
	CMainProc();
	~CMainProc();

	// メンバ関数
	void ToggleFullScreen(HWND hWnd);

private:
	RECT m_Windowrect;	// ウィンドウの幅
};