//=========================================================
//
// マップマネージャー処理 [ mapmanager.cpp ]
// Author : Asuma Nishio
//
//=========================================================

//*********************************************************
// インクルードファイル
//*********************************************************
#include "mapmanager.h"
#include "mapobject.h"
#include "modellist.h"
#include "manager.h"

//=========================================================
// コンストラクタ
//=========================================================
CMapManager::CMapManager(int nPriority) : CObject(nPriority)
{
	// 値のクリア
	m_MapObj.clear();
}
//=========================================================
// デストラクタ
//=========================================================
CMapManager::~CMapManager()
{
	// 無し
}
//=========================================================
// 初期化
//=========================================================
HRESULT CMapManager::Init(void)
{
	// 初期化結果を返す
	return S_OK;
}
//=========================================================
// 終了
//=========================================================
void CMapManager::Uninit(void)
{
	// 値のクリア
	m_MapObj.clear();

	// 自身の破棄
	CObject::Release();
}
//=========================================================
// 更新
//=========================================================
void CMapManager::Update(void)
{

}
//=========================================================
// 描画
//=========================================================
void CMapManager::Draw(void)
{
}
//=========================================================
// 生成処理
//=========================================================
CMapManager* CMapManager::Craete(void)
{
	// インスタンス生成
	CMapManager* pMapManager = new CMapManager;

	// nullなら
	if (pMapManager == nullptr) return nullptr;

	// 初期化失敗時
	if (FAILED(pMapManager->Init()))
	{
		return nullptr;
	}

	// 生成されたポインタを返す
	return pMapManager;
}