//=========================================================
//
// 選択ポイントUI処理 [ pointui.cpp ]
// Author: Asuma Nishio
//
//=========================================================

//*********************************************************
// インクルードファイル
//*********************************************************
#include "pointui.h"

//*********************************************************
// 名前空間
//*********************************************************
namespace POINTINFO
{
	constexpr float POINTWIDTH = 30.0f;		// 横幅
	constexpr float POINTHEIGHT = 40.0f;	// 高さ
};

//=========================================================
// コンストラクタ
//=========================================================
CPointUi::CPointUi(int nPriority) : CObject2D(nPriority)
{
	// 値のクリア
}
//=========================================================
// デストラクタ
//=========================================================
CPointUi::~CPointUi()
{
	// 無し
}
//=========================================================
// 生成処理
//=========================================================
CPointUi* CPointUi::Create(D3DXVECTOR3 pos)
{
	// インスタンス生成
	CPointUi* pPoint = new CPointUi;
	if (pPoint == nullptr) return nullptr;

	// 初期化失敗時
	if (FAILED(pPoint->Init()))
	{
		return nullptr;
	}

	// オブジェクト設定
	pPoint->SetPos(pos);
	pPoint->SetSize(POINTINFO::POINTWIDTH, POINTINFO::POINTHEIGHT);
	pPoint->SetAnchor(CObject2D::ANCHORTYPE_CENTER);
	pPoint->SetTexture("PointUi.png");

	// 生成されたポインタを返す
	return pPoint;
}
//=========================================================
// 初期化処理
//=========================================================
HRESULT CPointUi::Init(void)
{
	// 親クラスの初期化処理
	CObject2D::Init();

	// 初期化結果
	return S_OK;
}
//=========================================================
// 終了処理
//=========================================================
void CPointUi::Uninit(void)
{
	// 親クラスの終了処理
	CObject2D::Uninit();
}
//=========================================================
// 更新処理
//=========================================================
void CPointUi::Update(void)
{
	// 親クラスの更新処理
	CObject2D::Update();
}
//=========================================================
// 描画処理
//=========================================================
void CPointUi::Draw(void)
{
	// 親クラスの描画処理
	CObject2D::Draw();
}