//=========================================================
//
// ランキングシーン処理 [ ranking.h ]
// Author: Asuma Nishio
//
//=========================================================

//*********************************************************
// インクルードガード
//*********************************************************
#pragma once

//*********************************************************
// インクルードファイル
//*********************************************************
#include "scene.h"

//*********************************************************
// 前方宣言
//*********************************************************
class CRankingManager;

//*********************************************************
// ランキングシーンクラスを定義
//*********************************************************
class CRanking : public CScene
{
public:
	// コンストラクタ・デストラクタ
	CRanking();
	~CRanking();

	// メンバ関数
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);

	// 静的メンバ関数
	static CRanking* Create(void);

private:
	CRankingManager* m_pRankManager;	// クラスポインタ
};