//==================================================
//
// サブプレイヤー状態管理処理 [ subplayerstate.cpp ]
// Author: Asuma Nishio
//
//==================================================

//*********************************
// インクルードファイル
//*********************************
#include "subplayerstate.h"

//==============================
// コンストラクタ
//==============================
CSubPlayerState::CSubPlayerState()
{
	// 値のクリア
	m_pSubPlayer = nullptr;
	m_ID = ID_NEUTRAL;
}
//==============================
// デストラクタ
//==============================
CSubPlayerState::~CSubPlayerState()
{
	// 無し
}
